QuantumLeaps/qpc-examples/arm-cm/dpp_ek-tm4c123gxl_mpu/qxk/bsp.c
__attribute__((aligned((1U << XTHREAD1_SIZE_POW2))))
uint8_t XThread1_sto[1U << XTHREAD1_SIZE_POW2];

#ifdef QF_MEM_ISOLATE
static MPU_Region const MPU_XThread1[3] = {
    { (uint32_t)XThread1_sto + 0x10U,          //---- region #0
      ((XTHREAD1_SIZE_POW2 - 1U) << MPU_RASR_SIZE_Pos) // size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (1U << MPU_RASR_C_Pos)                       // C=1
       + (0U << MPU_RASR_B_Pos)                       // B=0
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { GPIOF_AHB_BASE + 0x11U,                  //---- region #1
      ((9U - 1U) << MPU_RASR_SIZE_Pos)                // 2^9=512B size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (0U << MPU_RASR_C_Pos)                       // C=0
       + (1U << MPU_RASR_B_Pos)                       // B=1
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { 0U + 0x12U,                              //---- region #2
      0U },
};
#endif

// XThread2 thread............................................................
#define XTHREAD2_SIZE_POW2  ((uint32_t)10U)   // XThread2 instance + stack
#define XTHREAD2_STACK_SIZE ((uint32_t)880U)  // Thread2 stack size

__attribute__((aligned((1U << XTHREAD2_SIZE_POW2))))
uint8_t XThread2_sto[1U << XTHREAD2_SIZE_POW2];

#ifdef QF_MEM_ISOLATE
static MPU_Region const MPU_XThread2[3] = {
    { (uint32_t)XThread2_sto + 0x10U,          //---- region #0
      ((XTHREAD2_SIZE_POW2 - 1U) << MPU_RASR_SIZE_Pos) // size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (1U << MPU_RASR_C_Pos)                       // C=1
       + (0U << MPU_RASR_B_Pos)                       // B=0
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { GPIOF_AHB_BASE + 0x11U,                  //---- region #1
      ((9U - 1U) << MPU_RASR_SIZE_Pos)                // 2^9=512B size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (0U << MPU_RASR_C_Pos)                       // C=0
       + (1U << MPU_RASR_B_Pos)                       // B=1
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { 0U + 0x12U,                              //---- region #2
      0U },
};
#endif

// Idle thread ............................................................
#ifdef QF_MEM_ISOLATE

#ifdef Q_SPY
// Idle thread owns QS-RX, so it needs access to its data...

// size of QS_rxPriv_, as power-of-2
#define QS_RX_PRIV_SIZE_POW2 ((uint32_t)7U)
__attribute__((aligned((1U << QS_RX_PRIV_SIZE_POW2))))
QS_RxAttr QS_rxPriv_;
Q_ASSERT_STATIC(sizeof(QS_rxPriv_) <= (1U << QS_RX_PRIV_SIZE_POW2));

// size of QS-RX buffer, as power-of-2
#define QS_RX_BUF_SIZE_POW2 ((uint32_t)7U)
__attribute__((aligned((1U << QS_RX_BUF_SIZE_POW2))))
uint8_t QS_rxBuf[1U << QS_RX_BUF_SIZE_POW2];

static MPU_Region const MPU_Idle[3] = {
    { (uint32_t)&QS_rxPriv_ + 0x10U,           //---- region #0
      ((QS_RX_PRIV_SIZE_POW2 - 1U) << MPU_RASR_SIZE_Pos)  // size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (1U << MPU_RASR_C_Pos)                       // C=1
       + (0U << MPU_RASR_B_Pos)                       // B=0
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { (uint32_t)&QS_rxBuf + 0x11U,            //---- region #1
      ((QS_RX_BUF_SIZE_POW2 - 1U) << MPU_RASR_SIZE_Pos)  // size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (1U << MPU_RASR_C_Pos)                       // C=1
       + (0U << MPU_RASR_B_Pos)                       // B=0
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { 0U + 0x12U,                              //---- region #2
      0U },
};

#else // Q_SPY not defined

static MPU_Region const MPU_Idle[3] = {
    { 0U + 0x10U,                              //---- region #0
      0U },
    { 0U + 0x11U,                              //---- region #1
      0U },
    { 0U + 0x12U,                              //---- region #2
      0U },
};

#endif // Q_SPY not defined

#endif // QF_MEM_ISOLATE

// Shared Event-pools.........................................................
#define EPOOLS_SIZE_POW2 ((uint32_t)8U)

__attribute__((aligned((1U << EPOOLS_SIZE_POW2))))
static struct EPools {
    QF_MPOOL_EL(TableEvt) smlPool[2*N_PHILO];
    // ... other pools
} EPools_sto;
Q_ASSERT_STATIC(sizeof(EPools_sto) <= (1U << EPOOLS_SIZE_POW2));

//============================================================================
#ifdef QF_MEM_ISOLATE
//............................................................................
__attribute__(( used ))
void QF_onMemSys(void) {
    MPU->CTRL = MPU_CTRL_ENABLE_Msk        // enable the MPU
                | MPU_CTRL_PRIVDEFENA_Msk; // enable background region
    __ISB();
    __DSB();
}
//............................................................................
__attribute__(( used ))
void QF_onMemApp() {
    MPU->CTRL = MPU_CTRL_ENABLE_Msk; // enable the MPU
                // but do NOT enable background region
    __ISB();
    __DSB();
}
//............................................................................
// NOTE: the context-switch callback is called with interrupts DISABLED
void QF_onContextSw(QActive *prev, QActive *next) {
    MPU_Region const * const region =
        (next != (QActive *)0)
        ? (MPU_Region const *)(next->thread)
        : MPU_Idle;

    MPU->CTRL = 0U; // disable the MPU

